[
  {
    "address": "2203 N Riverside Dr, Tampa, FL",
    "price": "$1,600,000",
    "zipcode": "33601",
    "beds": "0",
    "baths": "0",
    "sqft": "",
    "garage": "0",
    "description": "This is the perfect opportunity to own prime property in the Ridgewood Park district of Tampa. This property sits on an oversized lot which would give a homeowner or a developer a canvas to build a custom home or potentially a multifamily development. There are three contiguous properties, this one included that are available for sale by the same owners. All properties together would provide an investor or developer the chance to seize an opportunity to develop on a significant stretch of riverfront land that offers build ability and zoning potential-not to mention stunning views of the Tampa skyline and Hillsborough River. This property is very central to everything Tampa has to offer such as eateries, schools, Armature Works and just a quick travel to the downtown area."
  },
  {
    "address": "2205 N Riverside Dr, Tampa, FL",
    "price": "$1,600,000",
    "zipcode": "33601",
    "beds": "4",
    "baths": "2",
    "sqft": "1905",
    "garage": "0",
    "description": "This is a perfect opportunity to own prime property in the Ridgewood Park district of Tampa. You will be welcomed into the four bedroom home by stepping into a gorgeous custom kitchen area complete with stainless appliances and a larger island. This home has an open floor concept that comes complete with a larger oversized yard, private pool, patio and importantly a front porch that you can enjoy the views of the separate waterfront parcel directly across the street on the Hillsborough River. Although the property sustained storm damage, this home still retains much of its original charm which is visible in the pre-hurricane photos. This home is being offered AS IS condition which creates the opportunity for renovation, a custom new rebuild or even reimagining the uses for a site layout. There are also three contiguous properties, this one included that are available for sale by the same owners. All properties together would provide an investor or developer the chance to seize an opportunity to develop on a significant stretch of riverfront land that offers water access, zoning potential and buildability. This property is very central to everything Tampa has to offer such as eateries, schools, Armature Works and just a quick travel to the downtown area. Call me today to schedule your showing for this prime opportunity. Photos present home prior to storm."
  },
  {
    "address": "1031 Andrew Aviles Cir, Tampa, FL",
    "price": "$315,000",
    "zipcode": "33601",
    "beds": "3",
    "baths": "3",
    "sqft": "1832",
    "garage": "0",
    "description": "End-Unit Townhome in Prime Location – Move-In Ready! Welcome to this beautifully updated 3-bedroom, 2.5-bathroom end-unit townhome, perfectly situated near Brandon Mall, Top Golf, and many other popular shopping and entertainment destinations. Tucked away in a gated community with no rear neighbors, this home offers the perfect blend of privacy, comfort, and convenience—including easy access to major highways, making your commute or weekend outings a breeze. As soon as you walk in, you’ll notice the luxury epoxy-coated floors that give the entire downstairs a sleek, modern look and create a bright, open feel. The main level features a spacious and functional layout that seamlessly connects the kitchen and dining areas. The kitchen boasts stainless steel appliances, expansive counter space, and a convenient breakfast bar that overlooks the living room. Large sliding glass doors flood the space with natural light and lead to a private back patio and peaceful green space—perfect for relaxing or entertaining. Crown molding adds an extra touch of elegance throughout the first floor. Upstairs, the updated staircase railing and flooring create a clean, modern aesthetic. The layout includes two generously sized bedrooms at the front of the home, a full guest bathroom, and a conveniently located upstairs laundry room. The primary suite is privately situated at the rear of the home and features a walk-in closet, soaking tub, and separate stand-up shower—creating a peaceful retreat. This home also includes several valuable upgrades such as a new roof (2024) , new A/C unit (2023), new refrigerator, under-sink water filtration system, new garbage disposal, garage door opener, and pre-wiring for a surround sound system. The low HOA fee of $350/month includes water, cable, internet, trash service, and access to the community pool, providing excellent value and a low-maintenance lifestyle. With its prime location, thoughtful upgrades, and fantastic community amenities, this townhome truly checks all the boxes. Schedule your private tour today—you don’t want to miss it!"
  },
  {
    "address": "2 S Treasure Dr, Tampa, FL",
    "price": "$999,400",
    "zipcode": "33601",
    "beds": "3",
    "baths": "3",
    "sqft": "1984",
    "garage": "0",
    "description": "***Impeccably Renovated 3BR/3BA Ranch on Prime Corner Lot in Beach Park*** Exceptional opportunity to own a beautifully updated ranch-style residence in prestigious Beach Park, one of South Tampa’s most desirable and well-established neighborhoods. Located on a prominent corner lot surrounded by multi-million-dollar estates, this home offers the perfect blend of elegance, comfort, and location. Designed with a spacious, open-concept layout, this 3-bedroom, 3-bathroom home features a split-bedroom floor plan, wood-look tile flooring throughout, and an abundance of natural light. Two generously sized ensuite bedrooms provide ideal accommodations for guests, in-laws, or a private office retreat. The thoughtfully designed interior features a formal living room, an open dining space, and a spacious family room with recessed lighting and sliding glass doors that lead to a private screened lanai. Perfect for entertaining, the lanai is finished with paver flooring, a ceiling fan, and a wall-mounted TV, all overlooking a fenced backyard and additional open patio area. This home was professionally remediated and fully renovated after minor flood damage from Hurricane Helene’s storm surge. Every detail has been addressed to deliver a move-in-ready, turnkey residence. Additional features include a two-car garage and zoning for A-rated schools: Grady Elementary, Coleman Middle, and Plant High School. Enjoy immediate access to Tampa International Airport, International Plaza, downtown Tampa, and the Gulf Coast beaches, as well as major commuter routes including the Howard Frankland Bridge, Veterans Expressway, and I-275. A rare offering in a timeless neighborhood—schedule your private tour today."
  },
  {
    "address": "711 S Bungalow Ter, Tampa, FL",
    "price": "$810,000",
    "zipcode": "33601",
    "beds": "2",
    "baths": "2",
    "sqft": "1360",
    "garage": "0",
    "description": "Nestled in the heart of Tampa’s iconic Bungalow Terrace neighborhood, this home beautifully blends 1916 charm with today’s must-have features. One of only two bungalows on the street offering dedicated parking for two vehicles, this rare gem has been thoughtfully updated while preserving its craftsman soul. Step into a storybook setting with a white picket fence enclosing a fully fenced front yard, newly completed for your furry friends, and a low-maintenance, picture-perfect artificial turf lawn. Recent updates include: newly painted exterior and brand-new roof (May 2025) with new chimney flashing. Inside, restored heart-of-pine floors, rich architectural millwork, built-ins, plantation shutters, and a cozy wood-burning fireplace invite you to relax and stay a while. The kitchen dazzles with marble floors, quartz countertops, high-end stainless appliances, and farmhouse sink—a dream for any home chef. The downstairs primary suite features a walk-in California closet and dual-sink en-suite bath, while the upstairs loft-style second bedroom offers 360-degree treetop views through panoramic windows. A charming copper pipe addition across an exposed beam makes a perfect spot for hanging plants. Enjoy upgraded essentials like PVC plumbing, a 2021 stainless fridge and washer/dryer, and your very own Tesla charger—a rare find in this historic district. Ideally located just steps to Hyde Park Village’s restaurants, boutiques, cinema, and open-air charm. This is the one you’ve been waiting for—classic, modern, and move-in ready."
  },
  {
    "address": "Unit-3 - 403 S Fremont Ave, Tampa, FL",
    "price": "$675,000",
    "zipcode": "33601",
    "beds": "3",
    "baths": "3",
    "sqft": "1748",
    "garage": "0",
    "description": "Welcome to this beautifully updated 3-bedroom, 2.5-bathroom townhome, ideally located in one of South Tampa’s most walkable neighborhoods—just a quick stroll to the Hyde Park Village for coffee, dining, shopping, and fun. Thoughtfully renovated with both comfort and lifestyle in mind, this home checks every box. Step inside to a bright, open floor plan and a stunning new kitchen featuring quartz waterfall counters, custom cabinetry, an expanded pantry, and stylish tile accents. Wood flooring flows throughout the main level, anchored by a cozy living room with a custom mantle. Upstairs, you’ll find all three bedrooms, including a spacious primary suite with room for a home office—or your Peloton. The luxe primary bath boasts sleek counters, a soaking tub, contemporary tilework, and a glass-enclosed shower. And then there’s the yard! The professionally turfed backyard with retractable lighted awnings offers a rare private green space—perfect for pets, kids, or weekend hangouts. With a new metal roof, low HOA fees, and an unbeatable location, this townhome delivers on style, convenience, and peace of mind. Live steps from everything you love in South Tampa and in a NON-required flood zone! This home sat high and dry during the storms last year."
  },
  {
    "address": "14047 Briardale Ln, Tampa, FL",
    "price": "$435,000",
    "zipcode": "33601",
    "beds": "3",
    "baths": "2",
    "sqft": "1581",
    "garage": "0",
    "description": "This home, located in the Lake Magdalene area, has a lot to offer. It features a spacious lot with room for expansion, a new roof (installed in 2023), and there are no HOA fees or flood insurance requirements. The living room and dining room combination can be customized to meet your needs, while the very large family room adjacent to the kitchen provides ample space and overlooks a lovely lanai and patio. Additionally, a convenient laundry room off the kitchen has access to the backyard. The primary bedroom includes an en-suite bathroom and features two closets, including a walk-in closet. The secondary bedrooms are also well-sized, equipped with custom closets and laminate flooring. The garage is large (19X25) and offers extra space for storage, a workbench, or an additional freezer. This home is in a great location, close to everything you need. Make this house your paradise!"
  },
  {
    "address": "905 N Willow Ave, Tampa, FL",
    "price": "$1,345,000",
    "zipcode": "33601",
    "beds": "5",
    "baths": "4",
    "sqft": "3315",
    "garage": "0",
    "description": "Under Construction. Built by one of South Tampa's premier builders, BCL Homes, this stunning custom 5-bedroom, 4-bathroom home in North Hyde Park offers exceptional attention to detail. Located within walking distance to Downtown Tampa, Hyde Park, Armature Works, and Julian B Lane Park, this home is perfectly situated for both convenience and lifestyle. First Floor Highlights: Impressive 10' ceilings create a bright, airy feel. A bedroom/office with a closet and full bath provides flexibility for guests or work-from-home needs. The chef's kitchen features: Custom 42\" shaker cabinets with soft-close drawers Level 2 designer quartz countertops Stylish designer tile backsplash Pendant lights over a large center island Upgraded stainless steel appliance package including built-in double ovens A convenient pot filler for easy cooking Extended walk-in pantry with solid shelving The spacious great room includes an electric fireplace. Luxury vinyl plank flooring throughout the main living areas with tile in the bathrooms. A mudroom with built-ins is located off the two-car garage. Second Floor Features: Two bedrooms share a Jack & Jill bath. A third bedroom has its own en-suite bath. The primary suite is spacious enough for a king-size bed and includes: Two walk-in closets A luxurious bath with a standalone soaking tub A large shower with both a rain shower and a regular showerhead Dual vanities with extra storage A large laundry room is conveniently located upstairs. Outdoor Living: The 70' x 103' lot provides a large backyard. An extended covered lanai runs across the back of the home, creating a perfect space for outdoor entertaining. This home truly combines style, comfort, and convenience, perfect for both everyday living and entertaining. Photos are from another property with the same floor plan."
  },
  {
    "address": "15316 Winding Creek Dr, Tampa, FL",
    "price": "$649,000",
    "zipcode": "33601",
    "beds": "4",
    "baths": "2",
    "sqft": "1888",
    "garage": "0",
    "description": "No you're not dreaming, but it feels that way...Welcome to 15316 Winding Creek Drive...And from the moment you step into this dream house, totally updated, you'll love everything you see...Beginning with the Kitchen: Stainless steel appliances-48\" SubZero refrigerator, SubZero Icemaker(I love those little top hat ice cubes!), Cove Dishwasher, Wolf Oven, Wolf Microwave, Wolf Induction CookTop, Gorgeous white Hood...White KraftMaid Cabinets everywhere, Key Cabinet, Spice Cabinet, Artisan White Tile Backsplash, Touchless Faucet, Reverse Osmosis Water System for Kitchen and Icemaker, Cambria Quartz Island with designer lighting above & Countertops in Whitendale, and those beautiful barn doors? That's the appliance pantry/coffee garage--12 outlets for every small appliance you could possibly want to plug in; and when you're done, just close the doors...Master bedroom features sliders to the lanai, barn style ceiling fan, an En Suite bathroom with white tiled shower and James Martin double Vanity...Bedrooms 2, 3 & 4, and the 2nd bathroom are on the opposite side of the home, each with gorgeous ceiling fans...The entire home has plantation shutters, shiplap walls and luxurious large format-6x48\" Daltile wood-plank ceramic tile flooring everywhere...The Living room and the dining room adjacent to the kitchen area offer comfort and great space for entertaining lots of friends and family...The living room sliders lead to the screened lanai with a skylight, pool & a million dollar view: Massive oaks romantically flank the backyard, while stepping stones lead you to the iron fence, and the pond beyond-where you can enjoy evenings as the sun sets behind the trees and the pond...There are flowers gardens everywhere and the sprinkler system can be controlled by an app on your phone! The metal roof has hidden fasteners and is the most secure and resilient roof available--There's simply too many upgrades to mention--you have to see this house for yourself to believe it! Centrally located, restaurants and shopping in all directions, and minutes from I-275...Come see this dream house today!"
  },
  {
    "address": "12212 Hidden Brook Dr, Tampa, FL",
    "price": "$399,900",
    "zipcode": "33601",
    "beds": "3",
    "baths": "2",
    "sqft": "1222",
    "garage": "0",
    "description": "Backyard Oasis! Updated 3 bedroom 2 bath home with cathedral ceilings and open floor plan. Kitchen has breakfast bar. Formal dining room with french doors that lead to patio overlooking screened Salt Water pool. Luxury Vinyl Tile throughout. Fully fenced backyard. Inside laundry room. Water filtration system is only 1 year old. . Garage has been converted to a bonus room. Roof was replaced around 2017. Hot water heater is only 5 yo. HVAC system is also only 5 years old. Pool filter motor is only 1 year old. Near parks, restaurants and shopping. East access to Tampa Airport."
  }
]