[
  {
    "address": "4736 Ashburn Pond Way, Tampa, FL",
    "price": "$2,150",
    "property_type": "Townhouse",
    "zipcode": "33601",
    "beds": "3",
    "baths": "3",
    "sqft": "1670",
    "garage": "0",
    "description": "Beautiful townhome available in Ashburn Square Townhouses features 3 bedrooms, 2.5 bathrooms with an attached garage. The inside of this well laid out Townhome feels spacious. The upstairs opens into loft that can be a great game room, study area/office, or second living room. The downstairs has an open floor plan with separate dining area and spacious living room. The sliding glass doors lead you to a patio where you can sit and enjoy your coffee. Spend time with family and friends at the community pool and park area. If you decide to apply for one of our properties: Screening includes credit/background check, income verification of 2.5 to 3 times the monthly rent and rental history verification. APPLICANT CHARGES: Application Fee: $75 each adult, 18 years of age and older (non-refundable). Lease Initiation Admin Fee: $150.00 after approval and upon signing. Security Deposit: Equal to one month’s rent on approved credit. $25 each pet application fee for pet verification (non-refundable). Current vaccination records will be required. ESA and service animals are FREE with verified documentation. Pet Fee if applicable (non-refundable) $350 each pet. All Rent Solutions residents are enrolled in the Resident Benefits Package (RBP) for $49.95/month which includes liability insurance, credit building to help boost the resident’s credit score with timely rent payments, HVAC air filter delivery (for applicable properties), our best-in-class resident rewards program, and much more! More details upon application.",
    "index": 99,
    "sale_type": "Rental"
  },
  {
    "address": "5201 N 10 Th St, Tampa, FL",
    "price": "$1,600",
    "property_type": "House",
    "zipcode": "33601",
    "beds": "2",
    "baths": "1",
    "sqft": "832",
    "garage": "0",
    "description": "Welcome to this cute and charming 2-bedroom, 1-bath home nestled in the heart of Seminole Heights! Step inside to find beautiful wood laminate flooring that flows throughout the open and airy floorplan. Ceiling fans in every room add a breezy comfort to the space. The kitchen is a dream, featuring an all-white appliance package, ample cabinetry for storage, and a clean, bright aesthetic perfect for home cooks and entertainers alike. Just outside, enjoy the fully fenced backyard—ideal for pets, gatherings, or simply relaxing under the covered patio. A handy storage shed keeps tools and toys tucked away with ease. Washer and dryer are included for your convenience. Located just minutes from major highways, local dining, and shopping, this gem offers both comfort and convenience in one of Tampa’s most sought-after neighborhoods. Don’t miss your chance to call this Seminole Heights charmer home! In addition to the advertised base rent, all residents are enrolled in the Resident Benefits Package (RBP) for $50.00/month which includes HVAC air filter delivery, credit building to help boost your credit score with timely rent payments, utility concierge service making utility connection a breeze during your move-in, and much more! More details upon application. Pets welcome! Vacant and Available Now!",
    "index": 100,
    "sale_type": "Rental"
  },
  {
    "address": "3130 W Euclid Ave, Tampa, FL",
    "price": "$3,400",
    "property_type": "House",
    "zipcode": "33629",
    "beds": "3",
    "baths": "3",
    "sqft": "1275",
    "garage": "0",
    "description": "This home is close to everything that makes South Tampa amazing. Located in a Blue Ribbon School District, this updated 3 bedroom, 2.5 bath house has a fenced in backyard, a storage shed, and a covered parking spot. The open kitchen has granite countertops, newer cabinetry and newer stainless steel appliances. Located a short distance from Bayshore, the Selman Expressway and just a few miles from downtown Tampa, this house is convenient to great south Tampa restaurants, watering holes, and shopping. Available for move-in 8/1/25.",
    "index": 101,
    "sale_type": "Rental"
  },
  {
    "address": "12287 Country White Cir, Tampa, FL",
    "price": "$1,850",
    "property_type": "Townhouse",
    "zipcode": "33601",
    "beds": "2",
    "baths": "2",
    "sqft": "1146",
    "garage": "0",
    "description": "Welcome to this beautifully maintained 2-bedroom, 1.5-bath townhome nestled in the highly sought-after Country Place community, just minutes from Westchase’s vibrant dining, shopping, and entertainment. This home features an open floor plan with gorgeous hardwood floors throughout the main living areas, brand new carpet in both bedrooms, and tile in all wet areas for easy maintenance. The upstairs layout includes a spacious primary bedroom with soaring ceilings and a large walk-in closet, convenient access to a Jack-and-Jill bathroom—perfect for guests, roommates, or a home office setup. Enjoy your morning coffee or unwind in the evenings on the covered, screened lanai overlooking a peaceful pond. The kitchen and living space flow seamlessly, ideal for both entertaining and everyday living. Additional highlights include a laundry closet with a stackable washer and dryer, ample storage, and fresh, inviting finishes throughout. As a resident, you’ll also enjoy access to exceptional community amenities including a pool, tennis and basketball courts, fitness center, walking trails, and parks. This townhome offers both comfort and convenience in a tranquil setting—schedule your tour today!",
    "index": 102,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-203 - 1207 High Hammock Dr, Tampa, FL",
    "price": "$1,395",
    "property_type": "Condo",
    "zipcode": "33601",
    "beds": "1",
    "baths": "1",
    "sqft": "813",
    "garage": "0",
    "description": "Perfect Brandon Location - Crosswynde Condo! - 1BR / 1BA - Bright Brandon area condo with large windows facing mature trees and landscaping. Brand new laminate flooring throughout. NO CARPET!! This beautiful unit features a kitchen that flows into the living room with a nice open floor plan. Enjoy the evening breezes on your peacefully screened patio with French door opening. Crosswynde offers a sparkling swimming pool, fitness center and playground. Comfortable surroundings that's conveniently close to Downtown Tampa, historic Ybor City, I-75, the Crosstown Expressway and the Brandon Westfield Mall. Pets welcome at owner's discretion. Additional pet deposit or pet fee required. PLEASE NOTE: The community does not allow pets over 35lbs! No smoking is allowed.",
    "index": 103,
    "sale_type": "Rental"
  },
  {
    "address": "610 Luzon Ave, Tampa, FL",
    "price": "$6,250",
    "property_type": "House",
    "zipcode": "33606",
    "beds": "3",
    "baths": "2",
    "sqft": "1755",
    "garage": "0",
    "description": "MOVE IN READY & RECENTLY UPDATED! Beautiful 3 bedroom, 2 bath home located in highly sought after area of DAVIS ISLANDS! The property is a one-story home in a quiet community on a private fenced lot. Home features 1, 755 sq ft of luxurious living space with a fantastic open floor plan, high ceilings, beautiful updated Porcelain & Marble tile flooring throughout. This is the perfect place to call home! Enter the home to an open foyer with high ceilings. Spacious living room perfect for entertaining with beautiful wood-burning fireplace. Open updated kitchen with stunning quartz counters, beautiful cabinets with plenty of storage, stainless steel appliances, breakfast bar, nook area, wine fridge. Large master suite with walk in closet. Beautiful master bath with large walk-in shower with rain showerhead, dual stone sink vanity, freestanding soaking tub. Spacious private backyard with a wood deck that invites you to sit and enjoy evening sunsets that looks out onto the beautiful landscape. Plenty of backyard space to enjoy BBQ’s with family & friends! This home is a must see & won’t last! Great location! Davis Islands is a golf cart community. A+ rated schools. Close to all with plenty to do; shopping, restaurants, schools, Tampa International Airport, downtown Tampa, hospitals, golf courses, walking trails, tennis courts, dog parks & within walking distance to the town village, private yacht club, tennis, dog parks, Davis Islands Beach, Roy Jenkins Pool, MacDill Air Force Base, Bayshore Boulevard, Hyde Park Village, Riverwalk, Sparkman Wharf & Water Street. CALL TODAY FOR A PRIVATE TOUR OF THIS GREAT HOME!",
    "index": 104,
    "sale_type": "Rental"
  },
  {
    "address": "98 Baltic Cir, Tampa, FL",
    "price": "$20,000",
    "property_type": "House",
    "zipcode": "33606",
    "beds": "5",
    "baths": "6",
    "sqft": "3985",
    "garage": "0",
    "description": "Boater & Private Aviator’s Paradise! Live Like a Local Legend — On the Water, In the City! | DIRECT ACCESS TO OPEN TAMPA BAY, ST PETES & GULF | DEEP WATER | BOAT LIFT | DETACHED GUEST HOUSE | A RATED SCHOOLS| PROXIMITY TO ATHLETIC TRANING CENTERS : Tampa Bay Lightning (TGH Ice Plex, Brandon), Tampa Bay Buccaneers (AdventHealth Training Center), Tampa Bay Rays (Steinbrenner Field). Some addresses are more than locations — they’re destinations. At 98 Baltic Circle, you’re not just leasing a home. You’re stepping into one of Tampa’s most prestigious waterfront communities: Davis Islands. Steps from the water and minutes from Tampa’s most dynamic destinations. This rare leasing opportunity on Davis Islands presents a thoughtfully designed 4-bedroom, 4 and half bathroom home, plus office on the first floor, and a 1-bedroom, 1-bathroom detached mother-in-law suite — perfect for extended guests, in-laws, or private work-from-home setups. Enjoy private boat access via your own lift and a floating dock, with quick access to open bay waters. Enjoying morning coffee or sunsets over cocktails on your balcony, dock, or waterfront terrace. Whether you're boating, working remotely, or seeking an active lifestyle, this home offers it all. Fenced backyard, second-story balcony, and covered patio, Dedicated home office with French doors, Spacious garage with extra storage, Quiet, tree-lined street with mature landscaping. Prime Location: A+ rated schools, Minutes from USF Health & Morsani College of Medicine, Walkable to Tampa General Hospital, Proximity to Training centers for the Buccaneers, Lightning, and Rays, Easy access to downtown, the Tampa International airport, and Bayshore Blvd. Walk, bike or golf cart ride from cafés, parks, boutique shops and dog beach. Take a dip at the community pool, or enjoy a tennis match courtside. Fly out for business from Peter O. Knight, just 5 minutes away. Sail, dine, or socialize at the exclusive Yacht Club. Fishing, Kayaking, Weekend excursions to St. Pete or the Gulf. Notable Neighbors: Join a community that has drawn legends like Tom Brady, Derek Jeter, Vincent Lecavalier, and Bob Buckhorn — all captivated by Davis Islands’ rare blend of seclusion and proximity. Available in August for 12–24 month lease. Inquire today for a private showing and furnishing options.",
    "index": 105,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-616 - 18001 Richmond Place Dr, Tampa, FL",
    "price": "$1,400",
    "property_type": "Condo",
    "zipcode": "33601",
    "beds": "1",
    "baths": "1",
    "sqft": "732",
    "garage": "0",
    "description": "Welcome to your opportunity to lease a rare 1st floor residence with a brand new Kitchen.... Cabinetry and Granite Counters with Stainless Steel Appliances. This light and bright spacious 1 bedroom/1 bathroom condo is truly a great new sunny Florida home. The Screened in lanai with storage and sliding doors allows tons of light into the main living space, and offers additional living space to create your own outdoor oasis. The washer and dryer are located in a closet in the Bedroom. The Enclave at Richmond Place is a resort style condominium community in the Tampa Palms area. It is a gated community that features Tennis and Pickleball courts, playground, sand volleyball court, clubhouse, gym and a gorgeous community pool. Located just off of I-75 with easy access to New Tampa, Wesley Chapel or quick trip to downtown Tampa. Don't miss this opportunity! Move in this month! The condo is vacant so immediate occupancy is doable.",
    "index": 106,
    "sale_type": "Rental"
  },
  {
    "address": "12 - 9501 N 11 Th St, Tampa, FL",
    "price": "$1,300",
    "property_type": "Condo",
    "zipcode": "33601",
    "beds": "0",
    "baths": "1",
    "sqft": "",
    "garage": "0",
    "description": "New First floor STUDIO floorplan - around the corner from the Hillsborough River - well maintained freshly painted, charming & efficient. Beautiful upgraded bathroom, new kitchen cabinets, Refrigerator included. All you need to start fresh and no worries Utilities included it. Convenient to I4, downtown, close to USF & Tampa airport. To view a 3D tour copy and paste the following link: If you decide to apply for one of our properties: Screening includes credit/background check, income verification of 2.5 to 3 times the monthly rent and rental history verification. We encourage applicants with credit scores above 600 to apply, as meeting this criteria will help streamline the application process. APPLICANT CHARGES: Application Fees: $75 each adult, 18 years of age and older (non-refundable). $25 each pet application fee for pet verification (non-refundable). Current vaccination records will be required. ESA and service animals are FREE with verified documentation. Lease Initiation Admin Fee: $150.00 after approval and upon signing. Security Deposit: Equal to one month’s rent. Pet Fee if applicable (non-refundable) $350 each pet. All Rent Solutions residents are enrolled in the Resident Benefits Package (RBP) for $49.95/month which includes liability insurance, credit building to help boost the resident’s credit score with timely rent payments, HVAC air filter delivery (for applicable properties), our best-in-class resident rewards program, and much more! More details upon application.",
    "index": 107,
    "sale_type": "Rental"
  },
  {
    "address": "14059 Waterville Cir, Tampa, FL",
    "price": "$2,700",
    "property_type": "Townhouse",
    "zipcode": "33601",
    "beds": "3",
    "baths": "3",
    "sqft": "1912",
    "garage": "0",
    "description": "This Westchase townhome offers 3 Bedrooms, 2/1 bathrooms, a screened lanai and a screen master bedroom balcony. With a conservation rear view. Renewable lease option year after year. Walking distance to A+ Rated Elementary & Middle school, as well as grocery, shopping, dining and Starbucks.",
    "index": 108,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-2218 - 501 Knights Run Ave, Tampa, FL",
    "price": "$2,800",
    "property_type": "Condo",
    "zipcode": "33601",
    "beds": "2",
    "baths": "2",
    "sqft": "1073",
    "garage": "0",
    "description": "Welcome to Harbour Island! Located inside the gated Harbour Island Place City Homes community in Downtown Tampa. This well maintained, 1073sqft condo has 2 bedrooms with 2 en-suite bathrooms, a large living area, an eat-in kitchen with granite countertops and 1 covered parking space. Recent updates include new paint and new carpet. 4 month lease available, call for pricing. Located within the community is the resort-style pool with cabanas, BBQ grills, a fully equipped gym, and a car wash center. This gated neighborhood is seconds to several popular shops and restaurants, including Sparkman’s Wharf, the Channelside District, Downtown Tampa, and Amelie Arena. Go Lightning! A-Rated school district includes Gorrie Elementary, Wilson Middle, and Plant High.",
    "index": 109,
    "sale_type": "Rental"
  },
  {
    "address": "15412 Montilla Loop, Tampa, FL",
    "price": "$3,100",
    "property_type": "House",
    "zipcode": "33601",
    "beds": "4",
    "baths": "2",
    "sqft": "2014",
    "garage": "0",
    "description": "Recently Remodeled, 4 bedroom 2 Bath Carrollwood home with a large fenced in yard. New Luxury Vinyl plank throughout, freshly painted, both bathrooms updated, this home is ready for it's new occupant! The home has high ceilings with natural light and an open floor plan. Situated in Tampa close the airport, veterans expressway, and easy access to downtown Tampa, beaches, shopping, etc.",
    "index": 110,
    "sale_type": "Rental"
  },
  {
    "address": "719 W Woodlawn Ave, Tampa, FL",
    "price": "$3,790",
    "property_type": "House",
    "zipcode": "33603",
    "beds": "3",
    "baths": "2",
    "sqft": "1120",
    "garage": "0",
    "description": "Escape to your private tropical oasis in the heart of downtown Tampa! This stunning 3 bedroom, 2 bathroom home boasts a backyard paradise perfect for entertaining, featuring a spacious Trex decking patio, covered pergola, bench swing, fire pit, and dog run - perfect for entertaining or relaxing in peace! Dogs are welcome! Inside, enjoy modern comforts like ceiling fans in every room, a custom walk-in California closet system in the master bedroom, and included appliances like a washer, dryer, energy-efficient A/C, dishwasher, garbage disposal, and range. Additional storage space in the rear, accommodating boats, RVs, or other oversized vehicles with ease. Located in the booming Riverside Heights neighborhood, this newly remodeled home is just minutes from Armature Works, downtown Tampa, the airport, Raymond James Stadium, and I-275. Schedule a showing today! LEASE DETAILS/ DURATION: - 1 year minimum MOVE-IN FEES: - First month's rent - Last month's rent - Security deposit - Pet Policy: Pet deposit required for furry friends UTILITY RESPONSIBILITIES / TENANTS RESPONSIBLE FOR: - Electricity - Water/Sewer/Trash - Internet/Cable",
    "index": 111,
    "sale_type": "Rental"
  },
  {
    "address": "920 W Coral St, Tampa, FL",
    "price": "$5,200",
    "property_type": "House",
    "zipcode": "33602",
    "beds": "4",
    "baths": "4",
    "sqft": "2315",
    "garage": "0",
    "description": "Welcome to this beautifully upgraded 4-bedroom, 3.5-bathroom home in the heart of Tampa! Nestled just minutes from Armature Works and downtown Tampa, this residence offers the perfect blend of comfort, functionality, and modern style. Downstairs, the home features a gourmet kitchen with granite countertops and sleek stainless steel appliances, open floor-plan, ideal for entertaining and family gatherings, and large laundry room with ample space for organization. The second floor includes the spacious primary bedroom featuring a luxurious walk-in shower, two additional bedrooms with one full bathroom, and an attached mother-in-law suite with its own private entrance, full kitchen, and bathroom, perfect for guests, extended family, or a work-from-home setup. The backyard is an outdoor oasis with a screened-in lanai overlooking a fully fenced, turfed backyard for easy maintenance and outdoor enjoyment and front includes a two-car garage with additional driveway parking. This home is ideal for a family looking to be in one of Tampa's top neighborhoods. Opportunity to rent the entire home or just the 3 bedroom 2.5 bathroom main home and/or one bed one bath mother-in-law suite.",
    "index": 112,
    "sale_type": "Rental"
  },
  {
    "address": "6211 English Hollow Rd, Tampa, FL",
    "price": "$3,150",
    "property_type": "House",
    "zipcode": "33647",
    "beds": "4",
    "baths": "3",
    "sqft": "2555",
    "garage": "0",
    "description": "This beautiful, modern and spacious 4 bedroom 3 full bathroom home in Tampa Palms is ready for you. The home offers great curb appeal, beautiful landscaping, plenty of parking and a fully-fenced backyard. Stepping inside, you are greeted with modern colors, high ceilings and a spacious foyer. To the immediate left you find a bonus room offering you a formal living room, formal dining room, flex space or home office. Further inside, the home opens up to a great room shared with a large eat-in kitchen. The great room offers plenty of space for furniture, lots of natural light and durable ceramic tile flooring. The kitchen shares the same space and is equipped with black/stainless steel appliances, granite counters, reverse osmosis drinking/cooking water dispenser, designer faucet, glass mosaic backsplash, satin nickel drawer hardware and plenty of work space. Upstairs you find a comfortable loft, primary bedroom and two secondary bedrooms. The loft can host many activities or be simply used for relaxing. The primary suite includes a supersized walk-in closet, luxury bath with two sinks topped with a granite counter, garden tub, glass enclosed shower and a private water closet. The two secondary bedrooms share a hall bath. Downstairs hosts the 4th bedroom and 3rd full bath. The rear lanai is covered and screened allowing you to enjoy the great Florida weather. The rear yard is fenced and offers plenty of space for fun and games. The two-car garage has a door opener, elevated steel shelving and a highly efficient water heater. The house is provided with filtered and conditioned water. Lawn maintenance is included. This is a deed restricted neighborhood. Please note that high credit scores and proof of income is a must. Minimum $9, 000 monthly income required. All commercial vehicles must be parked inside the garage at all times. A Renter's Insurance Policy will be required at lease signing including liability coverage. A nationwide background and credit check will be performed on all adults.",
    "index": 113,
    "sale_type": "Rental"
  },
  {
    "address": "Unit-302 - 3507 Bayshore Blvd, Tampa, FL",
    "price": "$10,500",
    "property_type": "Condo",
    "zipcode": "33601",
    "beds": "2",
    "baths": "3",
    "sqft": "2909",
    "garage": "0",
    "description": "Welcome to this stunning 2-bedroom + den, 3-bath residence offering refined living with high-end finishes and exceptional comfort. Thoughtfully designed for both entertaining and relaxation, this spacious home features rich wood flooring throughout, custom built-ins in the dining and living areas, and an abundance of natural light. The gourmet eat-in kitchen is a chef’s dream, complete with cherry cabinetry, stainless steel appliances, a prep island, and double ovens—ideal for hosting or everyday convenience. A large front balcony off the main living area offers a perfect setting for dining and entertaining. Retreat to the luxurious primary suite with its own private balcony, his and hers walk-in closets, and a spa-like bath featuring a large walk-in shower with pebble stone flooring and custom cabinetry that provides ample storage. The generously sized second bedroom also boasts a private balcony, a large walk-in closet, and a beautifully appointed ensuite bath with a walk-in shower—perfect for guests or family members. Additional highlights include a versatile den—ideal for a home office or media room—and a third full bathroom. Residents enjoy access to a full suite of upscale community amenities, including a sparkling pool, state-of-the-art fitness center, elegant club room, private theatre, and 24/7 onsite security. The unit also comes with two secure, assigned parking spaces. Conveniently located in South Tampa—minutes to Tampa International Airport, Bay Area beaches, local theme parks, Downtown Tampa, The Riverwalk, and International Mall.",
    "index": 114,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-308 - 5616 Pinnacle Heights Cir, Tampa, FL",
    "price": "$1,590",
    "property_type": "Condo",
    "zipcode": "33601",
    "beds": "2",
    "baths": "1",
    "sqft": "868",
    "garage": "0",
    "description": "AVAILABLE now with owner and Association approvals! This condo is located in a community that has major roads all around it and allows you to get anywhere easily. This is a 1 bedroom, 1 bath condo plus a den and is on the 3rd floor with a balcony. Open and plenty of natural light to be let in by the blinds. Water/Sewer/Trash Included. If water charges exceed $40, tenant is responsible to pay the overage. HOA maintains grounds. There is a living room/dining room combination, just off of the kitchen. There is carpet in all the living areas and bedrooms with new vinyl flooring in the kitchen and bath. No Pets Preferred. Popular community has a pool, car care area, basketball court, clubhouse with fitness center. EQUAL HOUSING OPPORTUNITY",
    "index": 115,
    "sale_type": "Rental"
  },
  {
    "address": "Unit-901 - 1209 E Cumberland Ave, Tampa, FL",
    "price": "$4,500",
    "property_type": "Condo",
    "zipcode": "33601",
    "beds": "1",
    "baths": "2",
    "sqft": "1172",
    "garage": "0",
    "description": "AVAILABLE AUGUST 1ST! LOCATION! LOCATION! LOCATION! Live in the heart of Downtown Tampa in this gorgeous 1 bedroom, 1.5 bathroom condo with stunning water views from the 9th floor! This unit features an open-concept layout with hardwood and tile flooring throughout, a spacious wrap-around balcony showcasing breathtaking views of the city skyline and waterfront, and an additional den. The kitchen is a chef’s dream, equipped with stone countertops, stainless steel appliances, and a stylish bar area perfect for entertaining. The primary bedroom is generously sized and includes a private ensuite bathroom, while the den offers flexibility for a home office or guest space, complete with access to the guest bathroom. Enjoy resort-style living at The Towers at Channelside with a gorgeous pool with poolside cabanas, bar, and huge TV, two dog parks with a dedicated dog wash station, resident clubhouse, 24/7 security, concierge, and more! Unbeatable location between Water Street and Channelside District, steps from Amalie Arena, Sparkman Wharf, Tampa Aquarium, cruise port, restaurants, shops, and all that vibrant Downtown Tampa has to offer. Pets accepted on a case-by-case basis; owner must approve. Pet Screening required for approved pets. Lease admin of $150 due at move-in. Application Required for all persons 18 years and older, Minimum qualifications include credit score of 600 or better, verifiable gross monthly income of at least 3x the amount of monthly rent, no evictions or landlord tenant collections, and stable rental history required. If applicable - HOA Approval Required. Any HOA application fee must be paid by tenant.",
    "index": 116,
    "sale_type": "Rental"
  },
  {
    "address": "3007 N Adams St, Tampa, FL",
    "price": "$1,800",
    "property_type": "House",
    "zipcode": "33611",
    "beds": "3",
    "baths": "1",
    "sqft": "910",
    "garage": "0",
    "description": "The simple affordable Florida Life this charming 3Bedroom, 1 Bathroom home, located close to MacDill AF Base and near the Gandy Blvd. The beautiful kitchen has all snowy appliances and spacious cabinets, neutral colors throughout the home. The bedrooms have carpet and provide that private space. Admire the beautiful ceramic tile flooring throughout the home. This home has an amazing backyard to spend those well-deserved quiet weekends reading a book or catching the Florida sun. Open driveway has plenty of room for parking. Great location, walking distance to Bayshore. Washer/Dryer hook available. Close to all major shopping, beaches, Tampa International Airport, Bayshore Blvd and Downtown Tampa. We show properties 7days a week, contact us now for a showing. No HOA fees and move in ready, contact us now!!",
    "index": 117,
    "sale_type": "Rental"
  },
  {
    "address": "2913 N 18 Th St, Tampa, FL",
    "price": "$2,595",
    "property_type": "House",
    "zipcode": "33601",
    "beds": "5",
    "baths": "2",
    "sqft": "1683",
    "garage": "0",
    "description": "Welcome to this charming and historic 5-bedroom, 2-bath home nestled in the heart of Ybor City, Tampa, Florida. Steeped in history and character, this residence seamlessly combines classic architecture with modern amenities to provide a unique and inviting living experience. As you step through the front door, you'll be greeted by the warmth of timeless elegance of the detailed craftsmanship that defines this historic gem. The spacious living areas provide ample room for entertaining or relaxing with family and friends. This home boasts four well-appointed bedrooms, ensuring plenty of space for personal retreats or a growing family. The large bonus room/den is a versatile space that can be tailored to suit your specific needs, whether it's a home office, playroom, or an additional lounge area. The well-equipped kitchen is a chef's delight, featuring modern appliances and plenty of counter space for culinary creations. A convenient washer and dryer are included, making laundry chores a breeze. Step outside to discover the expansive patio area, perfect for al fresco dining, morning coffee, or evening relaxation. The sizable fenced-in backyard offers both privacy and security, making it an ideal space for pets, play, and outdoor gatherings. With back street access, you'll find added convenience for parking and easy entry. Situated close to highways, commuting is a breeze, allowing you to explore all that Tampa has to provide. Ybor City's vibrant atmosphere, rich history, and cultural diversity are right at your doorstep, offering a unique and lively neighborhood experience. Don't miss the opportunity to make this historic home in Ybor City your own. Schedule a viewing today and discover the perfect blend of old-world charm and modern living conveniences. Welcome home! If you decide to apply for one of our properties: Screening includes credit/background check, income verification of 2.5 to 3 times the monthly rent and rental history verification. We encourage applicants with credit scores above 600 to apply, as meeting this criteria will help streamline the application process. APPLICANT CHARGES: Application Fees: $75 each adult, 18 years of age and older (non-refundable). $25 each pet application fee for pet verification (non-refundable). Current vaccination records will be required. ESA and service animals are FREE with verified documentation. Lease Initiation Admin Fee: $150.00 after approval and upon signing. Security Deposit: Equal to one month’s rent. Pet Fee if applicable (non-refundable) $350 each pet. All Rent Solutions residents are enrolled in the Resident Benefits Package (RBP) for $49.95/month which includes liability insurance, credit building to help boost the resident’s credit score with timely rent payments, HVAC air filter delivery (for applicable properties), our best-in-class resident rewards program, and much more! More details upon application.",
    "index": 118,
    "sale_type": "Rental"
  },
  {
    "address": "1 Tuscany Aly, San Francisco, CA",
    "price": "$13,450",
    "property_type": "House",
    "zipcode": "94133",
    "beds": "4",
    "baths": "2",
    "sqft": "2036",
    "garage": "1",
    "description": "Tucked away on one of San Francisco's most charming hidden lanes, 1 Tuscany Alley is a rare and captivating furnished duplex being offered together in the heart of Telegraph Hill. This stunning property consists of two beautifully updated units, offering a total of 4 bed, 2 bath, office, 2 full kitchens and magical outdoor spaces including private roof deck with Golden Gate viewsmaking it ideal for a variety of households, from extended families to those needing flexible work-from-home options. Both units exude unique San Francisco charm, with warm hardwood floors, custom finishes, and windows that frame stunning views of the city and bay. The kitchens are thoughtfully designed with modern appliances, generous counter space, and stylish cabinetry, perfect for those who love to cook or entertain. The renovated bathrooms feature modern and luxurious designer finishes. Extraordinary outdoor spaces including Multiple decks and garden terraces provide a private oasis above the city, offering a front-row seat to panoramic vistas that stretch from Coit Tower to the Golden Gate Bridge. Enjoy morning coffee, dining al fresco, or simply soaking in the sunset, the outdoor experience here is unmatched. Located just steps from the best of SF!",
    "index": 119,
    "sale_type": "Rental"
  },
  {
    "address": "1201 - 1101 Green St, San Francisco, CA",
    "price": "$5,500",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "1",
    "baths": "1",
    "sqft": "921",
    "garage": "1",
    "description": "Fully Furnished Condo with Iconic Views in Bellaire Tower! Imagine life at the top of Russian Hill overlooking the San Francisco Bay, yet just a stone's throw from some of the city's best parks, cafs, and world-class cuisine. Located on the 12th floor of the prestigious BellaireTower, this designer-furnished residence offers unobstructed views of the Golden Gate Bridge, city skyline, and the bay. A rare blend of historic elegance and modern updates, this iconic Art Deco gem features archedhallways, high ceilings, crown moldings, built-in shelves, custom lighting and hardwood floors throughout. Classic 1920s architectural charm meets contemporary comfort in one of Russian Hill's most distinguished full-service buildings. As you enter the flat, a welcoming formal foyer leads into an open and inviting living and dining area framed by expansive views. The kitchen and bath have been thoughtfully updated with quality materials and finishes, offering both style and function. The primary bedroom features a spacious walk-in closet and en-suite bath, while a second room provides flexibility for a home office, library, or guest room. Perfect as a pied--terre or primary residence! Shared roof deck & 2 laundry rooms. No pets preferred. *video available upon request",
    "index": 120,
    "sale_type": "Rental"
  },
  {
    "address": "1337 Francisco St, San Francisco, CA",
    "price": "$9,500",
    "property_type": "Condo",
    "zipcode": "94123",
    "beds": "3",
    "baths": "3",
    "sqft": "1402",
    "garage": "1",
    "description": "Please do not text. Please email showing requests with address as subject. Luxurious Marina Edwardian Flat. Arched windows and period decor w/ modern, stunning, and high-end finishes. This home is well appointed w 3 true bedrooms/2.5 baths. Open concept living, dining, and kitchen. HDWD floors throughout. Primary bedroom offers a balcony, spcious spa-like bathroom, south facing, serene garden setting, and walk-in closet. Jack and Jill style bathroom between secondary bedroom / hallway. Generous storage and closets with custom built-ins. Full size laundry in unit. Side access to shared yard and garage. One car tandem parking included.",
    "index": 121,
    "sale_type": "Rental"
  },
  {
    "address": "1435 Newcomb Ave, San Francisco, CA",
    "price": "$2,600",
    "property_type": "House",
    "zipcode": "94124",
    "beds": "2",
    "baths": "1",
    "sqft": "1085",
    "garage": "1",
    "description": "83Very WalkableWalk Score®67Good TransitTransit Score®55BikeableBike Score®MLS® Number425050041Laundry LevelCentral VacNoFireplaceNoAcreage0.0574ExteriorGarageYesApprox. Age1924BasementDrivewayAttached, Independent, Yes, On Site (Single Family Only)Garage SpacesHeatCentralA/CHeating FuelExtras",
    "index": 122,
    "sale_type": "Rental"
  },
  {
    "address": "17 Woodland Ave, San Francisco, CA",
    "price": "$5,750",
    "property_type": "House",
    "zipcode": "94117",
    "beds": "3",
    "baths": "1",
    "sqft": "1650",
    "garage": "1",
    "description": "Step into this charming multilevel home that checks every box on your wish list! Perfectly situated in a prime Cole Valley location, this residence features a private garage and abundant natural light .Throughout the home, you'll find gorgeous original detailsgleaming hardwood floors, elegant coved ceilings, intricate crown molding, sparkling chandeliers, and classic glass doorknobs. The main floor boasts both living and family rooms brimming with character, including pocket doors, bay windows, and two cozy fireplacesideal for relaxing or entertaining. The spacious eat-in kitchen offers a dishwasher and a full bathroom on the same level. Two generously sized bedrooms on the main floor are filled with sunlight and offer expansive walk-in closets. Upstairs, the versatile pentroom (perfect as a third bedroom, office, or gym) spans the entire top floor and opens directly onto your private deckwhere you'll enjoy breathtaking views in every direction. Live in the heart of it all! You'll be just steps from public transit, fantastic restaurants, charming shops, playgrounds, UCSF, Mt. Sutro hiking trails, Golden Gate Park, and the beach. This home truly offers the best of city living with comfort, style, and historic charm.",
    "index": 123,
    "sale_type": "Rental"
  },
  {
    "address": "181 Marina Blvd, San Francisco, CA",
    "price": "$15,000",
    "property_type": "House",
    "zipcode": "94123",
    "beds": "3",
    "baths": "4",
    "sqft": "3410",
    "garage": "1",
    "description": "Live on one of San Francisco's most coveted streets in this stately 3, 400+ sq. Ft. Tudor-style home, directly across from the Marina Green & Fort Mason. Sweeping views of the Bay, this elegant Furnished two-level residence blends timeless architecture with vintage European furnishings, museum-quality art and modern amenities. Perfect for a Think Tank! The upper level includes 3 spacious bedrooms (2 ensuites), 3 full baths & an additional office that can function as a 4th bedroom. The main floor welcomes you with a grand foyer, formal living room w/fireplace, powder room & an open-concept kitchen, breakfast nook, lounge, and dining area all opening to a balcony that overlooks the lush garden below. The kitchen features rich dark wood cabinetry, granite countertops & modern appliances. A built-in hutch, large dining table for six & French doors leading to a balcony w/a BBQ make this an entertainer's dream. The backyard is a peaceful escape w/mature trees, large rose bushes, a tranquil pond & a patio seating area for 4 beneath a pine tree. Just outside your door is the scenic waterfront path stretching from Fort Mason to Crissy Field where you will find views of the Golden Gate Bridge & Bay. Quick access to 101, Muni & tech shuttles. Location is convenient & iconic!",
    "index": 124,
    "sale_type": "Rental"
  },
  {
    "address": "2 - 3491 Balboa St, San Francisco, CA",
    "price": "$7,200",
    "property_type": "Townhouse",
    "zipcode": "94101",
    "beds": "4",
    "baths": "4",
    "sqft": "1801",
    "garage": "1",
    "description": "Brand New built townhouse style home defines modern luxury living to the fullest. Sleek open concept kitchen with panel-ready refrigerator leads you into the functional great room with an adjacent powder room. The second level encompasses two bedroom suites and laundry closet. The top level features bedroom with gorgeous unobstructed ocean view and the owner's suite with amazing city view. We are not done. Climb another level up to your own rooftop deck where you'll impress your guests with unobstructed ocean and city views. Designated EV charging ready parking space in the garage supports sustainable living. Notice the beautiful wood floors and handsome floor to ceiling closets throughout the home. Amazing location with close proximity to the cafes and eateries on Balboa, Ocean Beach, Golden Gate Park, Lands End. Don't miss the opportunity to live in a brand new home in the beautiful Richmond District!",
    "index": 125,
    "sale_type": "Rental"
  },
  {
    "address": "2314 26 Th Ave, San Francisco, CA",
    "price": "$7,498",
    "property_type": "House",
    "zipcode": "94101",
    "beds": "4",
    "baths": "2",
    "sqft": "1795",
    "garage": "3",
    "description": "Spacious & Stylish Home for Rent in San Francisco's Parkside Neighborhood Live comfortably in this beautifully updated and light-filled home located in the highly desirable Parkside area of San Francisco. With plenty of space, modern features, and a fantastic location, this rental offers everything you need for relaxed city living. Rental Features: 4 large bedrooms with great closet space, Bonus multi-use room perfect for a home office, gym, or extra storage, 2 full bathrooms with modern tile and quality fixtures, Bright living room with large picture window, high ceilings, crown molding, and a cozy fireplace, Updated kitchen with granite countertops, stainless steel appliances, and custom cabinetry, Formal dining area ideal for entertaining, Beautiful hardwood floors and tasteful finishes throughout, Private garage w/ additional storage and in-unit washer & dryer , Spacious backyard with patio area - perfect for relaxing or outdoor dining Prime Location: Just one block from the L-Taraval MUNI line - easy commute to downtown, Ocean Beach, or West Portal, Minutes from 19th Ave for quick access to freeways heading south or north, Walk to nearby cafes, restaurants, parks, and grocery stores, Short drive or bike ride to Stonestown Galleria, SF State University, and Golden Gate Park",
    "index": 126,
    "sale_type": "Rental"
  },
  {
    "address": "3929 Clay St, San Francisco, CA",
    "price": "$9,500",
    "property_type": "Condo",
    "zipcode": "94118",
    "beds": "3",
    "baths": "2",
    "sqft": "2330",
    "garage": "1",
    "description": "Handsome, full floor three-bedroom, two-bathroom flat occupies the lower level in a boutique two-unit building with an exceptionally serene garden setting. The rooms are grand in scale with an excellent flow from all of the living areas and lots of natural light. The formal living room has a decorative fireplace, built-ins, and picture window. A formal dining room easily seats 8. A comfortable family room adjoins the kitchen. The renovated kitchen has appliances perfect for a home cook with double ovens, induction stove, dish washer, excellent cabinet space, and a spacious eat-in area. The Primary suite has garden outlooks with an adjoining spacious office area with direct access to an exclusive-use deck and patio in a tranquil garden setting with mature trees. All of the bedrooms have good closet space. In-unit washer and dryer. Coveted central location with the natural beauty of The Presidio and shops and cafes on Sacramento Street, Laurel Village, and Clement Street minutes away. The home includes one-car garage parking and storage. Property comes fully furnished.",
    "index": 127,
    "sale_type": "Rental"
  },
  {
    "address": "4 Museum Way, San Francisco, CA",
    "price": "$8,000",
    "property_type": "Condo",
    "zipcode": "94114",
    "beds": "2",
    "baths": "2",
    "sqft": "1569",
    "garage": "1",
    "description": "Views for days and available for move-in now! This top floor, bi-level condo features 2 generously sized bedrooms, each with beautiful vistas and walk-in closets and 2 modern bathrooms. The primary bedroom suite faces southwest toward Sutro tower. The second bedroom has a direct view of downtown San Francisco. The upstairs level also features the immense views in two directions, and holds an open concept and updated kitchen, dining area, and living space, with direct access to a large private deck that looks directly at Sutro Tower. This residence includes in-unit laundry and stainless steel appliances, including a dishwasher. 1 car parking is in the garage, with additional cars that may park in the long driveway. Conveniently located next to Corona Heights Park and close to Randall Museum and Buena Vista Park, with a nearby Muni stop for a quick ride or an easy stroll to restaurants, shops and cafes in exciting Castro District or Haight Ashbury. $8, 000 per month. Tenant pays for electricity, gas and internet. EQUAL HOUSING OPPORTUNITY. This rental unit is offered in compliance with federal, state and local anti- discrimination laws.",
    "index": 128,
    "sale_type": "Rental"
  },
  {
    "address": "64 Woodward St, San Francisco, CA",
    "price": "$4,095",
    "property_type": "Condo",
    "zipcode": "90110",
    "beds": "3",
    "baths": "1",
    "sqft": "3370",
    "garage": "0",
    "description": "Welcome to 64-68 Woodward Street a freshly updated 3-bedroom + living room, 1-bath apartment located on the first floor of a classic, rent-controlled 3-unit building with secure gated entry. This spacious flat offers a versatile layout, blending San Francisco charm with smart modern updates in one of the city's most vibrant neighborhoods. Highlights include: Flexible 3BR + living room layout perfect for roommates, work-from-home setups, or creative use of space Remodeled bathroom with stylish new tile and a step-in shower Updated eat-in kitchen with brand new cabinetry and ample storage Bonus mudroom with full-size private washer & dryer and extra storage great for bikes, gear, or workspace High ceilings, original hardwood floors, and fresh paint throughout Shared backyard space for relaxing or entertaining Secure gated entry for added peace of mind Tucked on a quiet block between the Mission and Duboce Triangle, you're just minutes from Dolores Park, Valencia Street, BART, MUNI, Whole Foods, and some of the best dining and nightlife in the city. Modern updates, historic charm, and rent-controlled stability all in an unbeatable location.",
    "index": 129,
    "sale_type": "Rental"
  },
  {
    "address": "909 Guerrero St, San Francisco, CA",
    "price": "$4,750",
    "property_type": "Condo",
    "zipcode": "90110",
    "beds": "3",
    "baths": "1",
    "sqft": "1452",
    "garage": "0",
    "description": "Available now! 909 Guerrero Street, a beautifully maintained full-floor Edwardian flat in the heart of the Mission's sought-after Liberty Hill neighborhood. This spacious 3-bedroom, 1-bath home offers a rare blend of classic architectural details with functional, modern updates. Discover soaring ceilings, original wood flooring, a brick fireplace, and other period built-ins that giving historic character. The remodeled kitchen is a bright and inviting space featuring stone countertops and ample cabinetry for storage. The unit includes two large, light-filled bedrooms, a split bathroom, and a versatile bonus room for use as a third bedroom, home office, lounge or creative studio. Additional amenities include an in-unit washer and dryer stack and a shared backyard. Set along the lively Valencia Corridor and just minutes from Noe Valley, this location offers excellent transit options (Transit Score 89). Enjoy access to renowned restaurants, cultural hotspots, boutique shopping, and iconic green spaces like Mission Dolores Park.",
    "index": 130,
    "sale_type": "Rental"
  },
  {
    "address": "A - 1020 Pierce St, San Francisco, CA",
    "price": "$4,200",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "2",
    "baths": "1",
    "sqft": "920",
    "garage": "0",
    "description": "Completely remodeled, spacious two-bedroom apartment in a historic Victorian built-in 1885 with 2 exclusive outside decks. Perfect to work from home inside & outside. Ideally located just two blocks from Alamo Square Park and 3 blocks from the bustling Divisadero Street restaurants and bars! Saturday and Sunday Farmers Markets, close to major tech shuttle stops and multiple major bus lines, make this a great neighborhood. The apartment has one huge front bedroom and another bedroom towards the backyard, which includes a beautiful deck overlooking a lush garden. The living room is spacious, with a fireplace and Victorian touches throughout. The fully equipped kitchen is big, fits a large kitchen table, and is equipped with a dishwasher, stone counters, and a full-size refrigerator. 3 more kitchen wall cabinets will be hung for additional storage. In-unit, high-quality laundry, and dryer, soaring ceilings, newer hardwood floors, closets, newer central heating, and remodeled bath. Tenant pays PG&E and water, no pets, owner requires good credit. This rental unit is subject to the San Francisco Rent Ordinance, which limits evictions without just cause. It states that any waiver by a tenant of their rights under the Rent Ordinance is void as contrary to public policy.",
    "index": 131,
    "sale_type": "Rental"
  },
  {
    "address": "A - 1774 27 Th Ave, San Francisco, CA",
    "price": "$4,750",
    "property_type": "House",
    "zipcode": "94101",
    "beds": "2",
    "baths": "2",
    "sqft": "1375",
    "garage": "1",
    "description": "Behind the modern facade, beautiful white oak hardwood floors, recessed lighting, plenty of natural light flows throughout the home's central patio & skylights. This home offers spacious living room with high ceilings & fireplace, formal dining room, central patio, dramatic chef's dream kitchen with premium finishes including quartz countertops, professional-grade appliances, modern cabinetry, breakfast area, 2BD/2BA w/1 master suite, & a deck with easy access to backyard. Easy maintained backyard perfect for BBQ & relaxation. Washer/dryer installed, parking on driveway, extra storage room in the garage. Close to park, gym, shops, restaurants, transits & TOP-RANKED schools. Sorry No pets.",
    "index": 132,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-101 - 1 S Park St, San Francisco, CA",
    "price": "$3,999",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "1",
    "baths": "1",
    "sqft": "928",
    "garage": "1",
    "description": "Step into luxury with this inviting large corner unit boasting a spacious open floor plan, Bamboo hardwood floors, and modern finishes throughout. Enjoy the convenience of in-unit W/D, 10' ceilings, and a sleek kitchen featuring granite counters, a breakfast bar and high-end Bosch appliances.Bathroom exudes tranquility with a double sink vanity and a luxurious tub with a shower over. One-car parking is included in the rent. Nestled in a boutique building, this home offers the perfect retreat in the heart of South Beach. With easy access to Muni, CalTrain, and freeways, as well as proximity to the city's vibrant Tech Hub and popular destinations in SOMA, FiDi, and the Embarcadero, this is urban living at its finest. Available August 8",
    "index": 133,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-201 - 1490 Ocean Ave, San Francisco, CA",
    "price": "$5,995",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "3",
    "baths": "2",
    "sqft": "1317",
    "garage": "1",
    "description": "Experience elevated luxury in this quiet, rear-facing, fully furnished 3BD/2BA designer residence with a private terrace offering sweeping views of Westwood and Monterey Heights. Set in an exclusive 15-residence boutique building, this modern home features an open layout filled with natural light, LED lighting, dual-pane windows, Nest thermostat, and keyless entry. The gourmet kitchen includes Italian cabinetry, soft-close drawers, Dekton countertops, a large island, Bertazzoni range, Bosch appliances, built-in wine fridge, and pantry. Living and dining areas open to a private deck with outdoor furniture, Weber grill, and sunset views. The serene primary suite offers two custom closets, deck access, and ensuite with double-sink vanity. Two additional bedrooms offer ample storage. Spa-like hallway bath includes a tub/shower combo and elegant finishes. Includes in-unit washer/dryer, A/C, 1-car parking, bike storage, WiFi, water, and garbage. Amenities: rooftop deck with outdoor kitchen, firepit, fitness center with dry sauna, elevator, and modern lobby. Ideally located near Whole Foods, Ocean Ave & West Portal dining, Stonestown, Stern Grove, Muni, BART, 280, and 19th Ave. Move-in ready.",
    "index": 134,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-201 - 725 Pine St, San Francisco, CA",
    "price": "$3,100",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "1",
    "baths": "1",
    "sqft": "551",
    "garage": "0",
    "description": "Posh Nob Hill 1 Bedroom 1 Bath furnished condo within the 1920's built former Lambourne boutique hotel with elevator. In-unit washer/dryer combo, private small deck off bedroom, stylish checkerboard flooring in large bathroom with shower, wood flooring throughout. Floor to ceiling wall closet. 100 Walkable Score to Nob Hill's world famous hotels, Chinatown, Union Square, North Beach restaurants, landmarks and public transportation; cable cars, MUNI and BART. San Francisco's chic condo living with all the charm!",
    "index": 135,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-201 - 821 Folsom St, San Francisco, CA",
    "price": "$3,390",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "1",
    "baths": "1",
    "sqft": "652",
    "garage": "1",
    "description": "This modern 1BD/1BA unit offers an open layout and Mirage hardwood flooring. The custom-designed kitchen features white Studio Becker cabinetry, Bosch stainless appliances, Neolith countertops, and a breakfast bar perfect for entertaining. Ample closet space with custom closet upgrades, in-unit laundry with an LG stacked washer/dryer, bathroom vanity, LED mirror and fresh paint complete this modern home. Available for an August 12 move-in. Shipley Square is a 78-unit boutique building situated in the sought-after Yerba Buena neighborhood, with a serene landscaped Parisian-inspired courtyard and a top-floor terrace with 360 city views. Conveniently located near many of San Francisco's top destinations, FiDi, Downtown, Yerba Buena Gardens, SFMOMA, restaurants, and shopping. Shipley Square offers excellent proximity to all methods of transportation: Muni, BART, Caltrain, 101/280, and Bay Bridge. A new central subway station and Caltrain are within a few minutes walk. Whole Foods is around the corner. Available as early as August 12.",
    "index": 136,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-315 - 300 3 Rd St, San Francisco, CA",
    "price": "$3,700",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "1",
    "baths": "1",
    "sqft": "884",
    "garage": "1",
    "description": "XLarge, 1-BR in Yerba Buena. This property is huge by today's standards with beautiful wood floors, floor to ceiling windows, great closet space and in-unit washer/dryer. The private outdoor patio (30' x 10') is the full length of the condo. Enjoy the lovely landscaped courtyard and listen to the birds. Located in the heart of the South of Market neighborhood at the corner of 3rd Street and Folsom. Conveniently located with easy access to restaurants, shopping, museums, the financial district, Union Square, Oracle Park, Chase Center, freeways and shuttles.The building has 24hr. Security, package management, elevator access to underground parking (add'l fee). Dry cleaners, Zip Car on site, and Crunch fitness center with heated pool (membership required).",
    "index": 137,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-410W - 101 Lombard St, San Francisco, CA",
    "price": "$4,000",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "1",
    "baths": "1",
    "sqft": "923",
    "garage": "1",
    "description": "Welcome to 101 Lombard, where sophisticated living meets unparalleled convenience in San Francisco's vibrant North Waterfront neighborhood. This extra spacious one bedroom home features an open concept living and dining area that opens to a large, private deck with views to the building's gardens, Coit Tower & Julius' Castle. An updated kitchen boasts granite countertops and stainless steel appliances. The bedroom suite features a large walk-in closet and bathroom with dual sinks. The unit is carpeted throughout. In-unit washer/dryer and one car parking complete the home. 101 Lombard's amenities include 24-hour security, heated pool, spa, and club room with a full kitchen. Positioned in a sunbelt with a walking score of 95, you're just steps from the Embarcadero, Ferry Building, and local favorites, making 101 Lombard an excellent choice for those who seek the best of city living. **Tenants are required to carry rental insurance for the duration of the lease.** **Available 7/15**",
    "index": 138,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-601 - 646 Corbett Ave, San Francisco, CA",
    "price": "$2,250",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "0",
    "baths": "1",
    "sqft": "2",
    "garage": "1",
    "description": "This lovely studio unit offers a bright, open floor plan and sweeping, unobstructed city views through large windows and your private balcony for a breath of fresh air. The kitchen has stainless steel appliances, sleek vinyl floors and abundant natural light. The building features a shared laundry in the basement and parking in the garage. Located in San Francisco's peaceful Upper Market neighborhood, there's easy access to public transportation and is just minutes from Twin Peaks, as well as the dining and shopping hotspots of Noe Valley, Cole Valley, and the Castro. With ample parking available and a tranquil hillside setting, 646 Corbett Ave offers the perfect balance of serene living and convenience.",
    "index": 139,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-717 - 403 Main St, San Francisco, CA",
    "price": "$4,249",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "1",
    "baths": "1",
    "sqft": "814",
    "garage": "1",
    "description": "Highly upgraded 1 Bedroom, 1 Bathroom with Den located at The Portside, one of the OG & staple buildings in the South Beach neighborhood. This highly updated unit features city skyline views from all windows and Bay Bridge views from the wind-protected balcony, expensive Custom oak hardwood floors throughout, Philips Hue smart app-enabled lighting, automated hand sensor faucet, water-filter, new LG dishwasher and in-unit washer & dryer, and stainless steel kitchen appliances. A designer natural stone (quartzite) breakfast bar, divides the kitchen area from the spacious living room, and a hidden alcove ideal for a home office. The bedroom boasts with a gorgeous Gucci wallpaper and an ample closet. The bathroom features Designer Carrera Marble, Top of the line Toto Washlet toilet, fittings by Restoration Hardware, light fixtures by Kelly Wearstler and HD Buttercup mirror, completed by a handcrafted oak wood and stone (quartzite) vanity. The Portside offers amazing amenities, including two gyms, secured parking, an on-site building manager, a pool and spa overlooking the Embarcadero. Walking distance to the financial district, Downtown, Ferry Building, the best restaurants in the area, and so much more. Easy access to Bart, Caltrain, and Interstates 101 and 280.",
    "index": 140,
    "sale_type": "Rental"
  },
  {
    "address": "Apt-7E - 401 Harrison St, San Francisco, CA",
    "price": "$4,590",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "1",
    "baths": "1",
    "sqft": "713",
    "garage": "1",
    "description": "Welcome to this bright and spacious residence at The Harrison, where resort-style living meets sophisticated design. This unique floor plan features soaring 9'6 ceilings and expansive floor-to-ceiling windows, bathing the home in natural light and showcasing stunning city & some bay views. The open-concept layout includes a generous living area and a gourmet kitchen with a breakfast bar, stainless steel appliances, Waterworks brass fixtures, and elegant Carrara marble countertops. Diagonally laid hardwood floors add a touch of refinement throughout. Located in the prestigious Harrison tower in Rincon Hill and masterfully designed by renowned interior designer Ken Fulk, this home offers access to world-class, 5-star amenities: 24/7 fully staffed lobby, The Pantry with daily coffee and pastries, A fully equipped fitness center, Heated outdoor pool and spa, The crown jewel: Uncle Harry's, the exclusive top-floor resident lounge featuring 100 linear feet of unobstructed Bay Bridge views. All of this, just moments away from San Francisco's top dining, entertainment, and waterfront destinations.",
    "index": 141,
    "sale_type": "Rental"
  },
  {
    "address": "Ph1cd - 765 Market St, San Francisco, CA",
    "price": "$21,000",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "3",
    "baths": "4",
    "sqft": "3510",
    "garage": "2",
    "description": "Fantastic opportunity to live in this fully furnished Four Seasons luxury Penthouse with a grand living room with an unparalleled wrap-around view which is a fitting residence for those who embrace San Francisco and all it has to offer. Huge 3 ensuite bedrooms plus a home office/den completes this comfortable home overlooking amazing San Francisco and beyond. Nestled in the downtown Yerba Buena neighborhood in the World Class Four Seasons Hotel. The lifestyle is inviting and bespoke catering to your fussiest needs. Large interior space, great for entertaining and relaxing and the most expansive panoramic downtown and Bay view among SF condos. Private residences offer 24/7 concierge, door and valet service.The neighborhood terrain is relatively flat and surrounded by adventure. This easy location offers direct to Highway 101/280/80, public transportation and BART are outside the front entrance. Door and valet service. 2 car included 3rd space available.",
    "index": 142,
    "sale_type": "Rental"
  },
  {
    "address": "Unit-2C - 318 Main St, San Francisco, CA",
    "price": "$5,200",
    "property_type": "Condo",
    "zipcode": "94101",
    "beds": "1",
    "baths": "2",
    "sqft": "1104",
    "garage": "1",
    "description": ".Lumina - This large 1BD/2BA plus Den and spacious terrace offers an unrivaled level of sophistication that elevate urban living beyond all expectation. High end finishes include Caesarstone quartz countertops. European porcelain flooring and shower tiles, Kohler bathroom fixtures, Gaggenau refrigerator and oven/rotisserie, five burner gas cooktop, Bosch dishwasher, In-unit washer/dryer, Custom cabinetry and Window coverings. Wood flooring in main living area with carpet in bedroom.",
    "index": 143,
    "sale_type": "Rental"
  }
]